Revit 2026 API

# ElectricalSystemSelectPanel Method

---

Set the panel for the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SelectPanel(
	FamilyInstance panel
)
```
```vb
Public Sub SelectPanel (
	panel As FamilyInstance
)
```
```cpp
public:
void SelectPanel(
	FamilyInstance^ panel
)
```
```fsharp
member SelectPanel :
        panel : FamilyInstance -> unit
```

#### Parameters

panel FamilyInstance
     The panel of the electrical system.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The panel does not have enough slots and Feed Through Lugs is unchecked or already in use. -or- Thrown when the panel cannot be set for the electrical system. |

If successful, the panel will be set for the system. Otherwise the exception will be thrown. This method will only function with the Autodesk Revit MEP application.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace